{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 28, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_6", "trainable": true, "dtype": "float32", "layer": {"class_name": "UnifiedLSTM", "config": {"name": "unified_lstm_6", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_7", "trainable": true, "dtype": "float32", "layer": {"class_name": "UnifiedLSTM", "config": {"name": "unified_lstm_7", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_8", "trainable": true, "dtype": "float32", "layer": {"class_name": "UnifiedLSTM", "config": {"name": "unified_lstm_8", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 16, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1.0000000116860974e-07, "amsgrad": false}}, "loss": "mse", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_6/forward_unified_lstm_6/kernel", "shape": [8, 256], "dtype": "float32"}, {"name": "bidirectional_6/forward_unified_lstm_6/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_6/forward_unified_lstm_6/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_6/backward_unified_lstm_6/kernel", "shape": [8, 256], "dtype": "float32"}, {"name": "bidirectional_6/backward_unified_lstm_6/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_6/backward_unified_lstm_6/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_7/forward_unified_lstm_7/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_7/forward_unified_lstm_7/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_7/forward_unified_lstm_7/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_7/backward_unified_lstm_7/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_7/backward_unified_lstm_7/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_7/backward_unified_lstm_7/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_8/forward_unified_lstm_8/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "bidirectional_8/forward_unified_lstm_8/recurrent_kernel", "shape": [16, 64], "dtype": "float32"}, {"name": "bidirectional_8/forward_unified_lstm_8/bias", "shape": [64], "dtype": "float32"}, {"name": "bidirectional_8/backward_unified_lstm_8/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "bidirectional_8/backward_unified_lstm_8/recurrent_kernel", "shape": [16, 64], "dtype": "float32"}, {"name": "bidirectional_8/backward_unified_lstm_8/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [800, 32], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [32, 3], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [3], "dtype": "float32"}, {"name": "embedding_2/embeddings", "shape": [28, 8], "dtype": "float32"}]}]}